espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_USER_REG register
 *  SPI1 user register.
 */
#define SPI1_MEM_S_USER_REG (DR_REG_PSRAM_MSPI1_BASE + 0x18)
/** SPI1_MEM_S_CK_OUT_EDGE : R/W; bitpos: [9]; default: 0;
 *  the bit combined with spi_mem_mosi_delay_mode bits to set mosi signal delay mode.
 */
#define SPI1_MEM_S_CK_OUT_EDGE    (BIT(9))
#define SPI1_MEM_S_CK_OUT_EDGE_M  (SPI1_MEM_S_CK_OUT_EDGE_V << SPI1_MEM_S_CK_OUT_EDGE_S)
#define SPI1_MEM_S_CK_OUT_EDGE_V  0x00000001U
#define SPI1_MEM_S_CK_OUT_EDGE_S  9
/** SPI1_MEM_S_FWRITE_DUAL : R/W; bitpos: [12]; default: 0;
 *  In the write operations read-data phase apply 2 signals
 */
#define SPI1_MEM_S_FWRITE_DUAL    (BIT(12))
#define SPI1_MEM_S_FWRITE_DUAL_M  (SPI1_MEM_S_FWRITE_DUAL_V << SPI1_MEM_S_FWRITE_DUAL_S)
#define SPI1_MEM_S_FWRITE_DUAL_V  0x00000001U
#define SPI1_MEM_S_FWRITE_DUAL_S  12
/** SPI1_MEM_S_FWRITE_QUAD : R/W; bitpos: [13]; default: 0;
 *  In the write operations read-data phase apply 4 signals
 */
#define SPI1_MEM_S_FWRITE_QUAD    (BIT(13))
#define SPI1_MEM_S_FWRITE_QUAD_M  (SPI1_MEM_S_FWRITE_QUAD_V << SPI1_MEM_S_FWRITE_QUAD_S)
#define SPI1_MEM_S_FWRITE_QUAD_V  0x00000001U
#define SPI1_MEM_S_FWRITE_QUAD_S  13
/** SPI1_MEM_S_FWRITE_DIO : R/W; bitpos: [14]; default: 0;
 *  In the write operations address phase and read-data phase apply 2 signals.
 */
#define SPI1_MEM_S_FWRITE_DIO    (BIT(14))
#define SPI1_MEM_S_FWRITE_DIO_M  (SPI1_MEM_S_FWRITE_DIO_V << SPI1_MEM_S_FWRITE_DIO_S)
#define SPI1_MEM_S_FWRITE_DIO_V  0x00000001U
#define SPI1_MEM_S_FWRITE_DIO_S  14
/** SPI1_MEM_S_FWRITE_QIO : R/W; bitpos: [15]; default: 0;
 *  In the write operations address phase and read-data phase apply 4 signals.
 */
#define SPI1_MEM_S_FWRITE_QIO    (BIT(15))
#define SPI1_MEM_S_FWRITE_QIO_M  (SPI1_MEM_S_FWRITE_QIO_V << SPI1_MEM_S_FWRITE_QIO_S)
#define SPI1_MEM_S_FWRITE_QIO_V  0x00000001U
#define SPI1_MEM_S_FWRITE_QIO_S  15
/** SPI1_MEM_S_USR_MISO_HIGHPART : R/W; bitpos: [24]; default: 0;
 *  read-data phase only access to high-part of the buffer spi_mem_w8~spi_mem_w15. 1:
 *  enable 0: disable.
 */
#define SPI1_MEM_S_USR_MISO_HIGHPART    (BIT(24))
#define SPI1_MEM_S_USR_MISO_HIGHPART_M  (SPI1_MEM_S_USR_MISO_HIGHPART_V << SPI1_MEM_S_USR_MISO_HIGHPART_S)
#define SPI1_MEM_S_USR_MISO_HIGHPART_V  0x00000001U
#define SPI1_MEM_S_USR_MISO_HIGHPART_S  24
/** SPI1_MEM_S_USR_MOSI_HIGHPART : R/W; bitpos: [25]; default: 0;
 *  write-data phase only access to high-part of the buffer spi_mem_w8~spi_mem_w15. 1:
 *  enable 0: disable.
 */
#define SPI1_MEM_S_USR_MOSI_HIGHPART    (BIT(25))
#define SPI1_MEM_S_USR_MOSI_HIGHPART_M  (SPI1_MEM_S_USR_MOSI_HIGHPART_V << SPI1_MEM_S_USR_MOSI_HIGHPART_S)
#define SPI1_MEM_S_USR_MOSI_HIGHPART_V  0x00000001U
#define SPI1_MEM_S_USR_MOSI_HIGHPART_S  25
/** SPI1_MEM_S_USR_DUMMY_IDLE : R/W; bitpos: [26]; default: 0;
 *  SPI clock is disable in dummy phase when the bit is enable.
 */
#define SPI1_MEM_S_USR_DUMMY_IDLE    (BIT(26))
#define SPI1_MEM_S_USR_DUMMY_IDLE_M  (SPI1_MEM_S_USR_DUMMY_IDLE_V << SPI1_MEM_S_USR_DUMMY_IDLE_S)
#define SPI1_MEM_S_USR_DUMMY_IDLE_V  0x00000001U
#define SPI1_MEM_S_USR_DUMMY_IDLE_S  26
/** SPI1_MEM_S_USR_MOSI : R/W; bitpos: [27]; default: 0;
 *  This bit enable the write-data phase of an operation.
 */
#define SPI1_MEM_S_USR_MOSI    (BIT(27))
#define SPI1_MEM_S_USR_MOSI_M  (SPI1_MEM_S_USR_MOSI_V << SPI1_MEM_S_USR_MOSI_S)
#define SPI1_MEM_S_USR_MOSI_V  0x00000001U
#define SPI1_MEM_S_USR_MOSI_S  27
/** SPI1_MEM_S_USR_MISO : R/W; bitpos: [28]; default: 0;
 *  This bit enable the read-data phase of an operation.
 */
#define SPI1_MEM_S_USR_MISO    (BIT(28))
#define SPI1_MEM_S_USR_MISO_M  (SPI1_MEM_S_USR_MISO_V << SPI1_MEM_S_USR_MISO_S)
#define SPI1_MEM_S_USR_MISO_V  0x00000001U
#define SPI1_MEM_S_USR_MISO_S  28
/** SPI1_MEM_S_USR_DUMMY : R/W; bitpos: [29]; default: 0;
 *  This bit enable the dummy phase of an operation.
 */
#define SPI1_MEM_S_USR_DUMMY    (BIT(29))
#define SPI1_MEM_S_USR_DUMMY_M  (SPI1_MEM_S_USR_DUMMY_V << SPI1_MEM_S_USR_DUMMY_S)
#define SPI1_MEM_S_USR_DUMMY_V  0x00000001U
#define SPI1_MEM_S_USR_DUMMY_S  29
/** SPI1_MEM_S_USR_ADDR : R/W; bitpos: [30]; default: 0;
 *  This bit enable the address phase of an operation.
 */
#define SPI1_MEM_S_USR_ADDR    (BIT(30))
#define SPI1_MEM_S_USR_ADDR_M  (SPI1_MEM_S_USR_ADDR_V << SPI1_MEM_S_USR_ADDR_S)
#define SPI1_MEM_S_USR_ADDR_V  0x00000001U
#define SPI1_MEM_S_USR_ADDR_S  30
/** SPI1_MEM_S_USR_COMMAND : R/W; bitpos: [31]; default: 1;
 *  This bit enable the command phase of an operation.
 */
#define SPI1_MEM_S_USR_COMMAND    (BIT(31))
#define SPI1_MEM_S_USR_COMMAND_M  (SPI1_MEM_S_USR_COMMAND_V << SPI1_MEM_S_USR_COMMAND_S)
#define SPI1_MEM_S_USR_COMMAND_V  0x00000001U
#define SPI1_MEM_S_USR_COMMAND_S  31

/** SPI1_MEM_S_USER1_REG register
 *  SPI1 user1 register.
 */
#define SPI1_MEM_S_USER1_REG (DR_REG_PSRAM_MSPI1_BASE + 0x1c)
/** SPI1_MEM_S_USR_DUMMY_CYCLELEN : R/W; bitpos: [5:0]; default: 7;
 *  The length in spi_mem_clk cycles of dummy phase. The register value shall be
 *  (cycle_num-1).
 */
#define SPI1_MEM_S_USR_DUMMY_CYCLELEN    0x0000003FU
#define SPI1_MEM_S_USR_DUMMY_CYCLELEN_M  (SPI1_MEM_S_USR_DUMMY_CYCLELEN_V << SPI1_MEM_S_USR_DUMMY_CYCLELEN_S)
#define SPI1_MEM_S_USR_DUMMY_CYCLELEN_V  0x0000003FU
#define SPI1_MEM_S_USR_DUMMY_CYCLELEN_S  0
/** SPI1_MEM_S_USR_ADDR_BITLEN : R/W; bitpos: [31:26]; default: 23;
 *  The length in bits of address phase. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_S_USR_ADDR_BITLEN    0x0000003FU
#define SPI1_MEM_S_USR_ADDR_BITLEN_M  (SPI1_MEM_S_USR_ADDR_BITLEN_V << SPI1_MEM_S_USR_ADDR_BITLEN_S)
#define SPI1_MEM_S_USR_ADDR_BITLEN_V  0x0000003FU
#define SPI1_MEM_S_USR_ADDR_BITLEN_S  26

/** SPI1_MEM_S_USER2_REG register
 *  SPI1 user2 register.
 */
#define SPI1_MEM_S_USER2_REG (DR_REG_PSRAM_MSPI1_BASE + 0x20)
/** SPI1_MEM_S_USR_COMMAND_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  The value of  command.
 */
#define SPI1_MEM_S_USR_COMMAND_VALUE    0x0000FFFFU
#define SPI1_MEM_S_USR_COMMAND_VALUE_M  (SPI1_MEM_S_USR_COMMAND_VALUE_V << SPI1_MEM_S_USR_COMMAND_VALUE_S)
#define SPI1_MEM_S_USR_COMMAND_VALUE_V  0x0000FFFFU
#define SPI1_MEM_S_USR_COMMAND_VALUE_S  0
/** SPI1_MEM_S_USR_COMMAND_BITLEN : R/W; bitpos: [31:28]; default: 7;
 *  The length in bits of command phase. The register value shall be (bit_num-1)
 */
#define SPI1_MEM_S_USR_COMMAND_BITLEN    0x0000000FU
#define SPI1_MEM_S_USR_COMMAND_BITLEN_M  (SPI1_MEM_S_USR_COMMAND_BITLEN_V << SPI1_MEM_S_USR_COMMAND_BITLEN_S)
#define SPI1_MEM_S_USR_COMMAND_BITLEN_V  0x0000000FU
#define SPI1_MEM_S_USR_COMMAND_BITLEN_S  28

/** SPI1_MEM_S_MOSI_DLEN_REG register
 *  SPI1 send data bit length control register.
 */
#define SPI1_MEM_S_MOSI_DLEN_REG (DR_REG_PSRAM_MSPI1_BASE + 0x24)
/** SPI1_MEM_S_USR_MOSI_DBITLEN : R/W; bitpos: [9:0]; default: 0;
 *  The length in bits of write-data. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_S_USR_MOSI_DBITLEN    0x000003FFU
#define SPI1_MEM_S_USR_MOSI_DBITLEN_M  (SPI1_MEM_S_USR_MOSI_DBITLEN_V << SPI1_MEM_S_USR_MOSI_DBITLEN_S)
#define SPI1_MEM_S_USR_MOSI_DBITLEN_V  0x000003FFU
#define SPI1_MEM_S_USR_MOSI_DBITLEN_S  0

/** SPI1_MEM_S_MISO_DLEN_REG register
 *  SPI1 receive data bit length control register.
 */
#define SPI1_MEM_S_MISO_DLEN_REG (DR_REG_PSRAM_MSPI1_BASE + 0x28)
/** SPI1_MEM_S_USR_MISO_DBITLEN : R/W; bitpos: [9:0]; default: 0;
 *  The length in bits of  read-data. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_S_USR_MISO_DBITLEN    0x000003FFU
#define SPI1_MEM_S_USR_MISO_DBITLEN_M  (SPI1_MEM_S_USR_MISO_DBITLEN_V << SPI1_MEM_S_USR_MISO_DBITLEN_S)
#define SPI1_MEM_S_USR_MISO_DBITLEN_V  0x000003FFU
#define SPI1_MEM_S_USR_MISO_DBITLEN_S  0

