espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_FLASH_SUS_CMD_REG register
 *  SPI1 flash suspend command register
 */
#define SPI1_MEM_S_FLASH_SUS_CMD_REG (DR_REG_PSRAM_MSPI1_BASE + 0xa0)
/** SPI1_MEM_S_FLASH_PES_COMMAND : R/W; bitpos: [15:0]; default: 30069;
 *  Program/Erase suspend command.
 */
#define SPI1_MEM_S_FLASH_PES_COMMAND    0x0000FFFFU
#define SPI1_MEM_S_FLASH_PES_COMMAND_M  (SPI1_MEM_S_FLASH_PES_COMMAND_V << SPI1_MEM_S_FLASH_PES_COMMAND_S)
#define SPI1_MEM_S_FLASH_PES_COMMAND_V  0x0000FFFFU
#define SPI1_MEM_S_FLASH_PES_COMMAND_S  0
/** SPI1_MEM_S_WAIT_PESR_COMMAND : R/W; bitpos: [31:16]; default: 5;
 *  Flash SUS/SUS1/SUS2 status bit read command. The command should be sent when
 *  SUS/SUS1/SUS2 bit should be checked to insure the suspend or resume status of flash.
 */
#define SPI1_MEM_S_WAIT_PESR_COMMAND    0x0000FFFFU
#define SPI1_MEM_S_WAIT_PESR_COMMAND_M  (SPI1_MEM_S_WAIT_PESR_COMMAND_V << SPI1_MEM_S_WAIT_PESR_COMMAND_S)
#define SPI1_MEM_S_WAIT_PESR_COMMAND_V  0x0000FFFFU
#define SPI1_MEM_S_WAIT_PESR_COMMAND_S  16

/** SPI1_MEM_S_SUS_STATUS_REG register
 *  SPI1 flash suspend status register
 */
#define SPI1_MEM_S_SUS_STATUS_REG (DR_REG_PSRAM_MSPI1_BASE + 0xa4)
/** SPI1_MEM_S_FLASH_SUS : R/W/SS/SC; bitpos: [0]; default: 0;
 *  The status of flash suspend, only used in SPI1.
 */
#define SPI1_MEM_S_FLASH_SUS    (BIT(0))
#define SPI1_MEM_S_FLASH_SUS_M  (SPI1_MEM_S_FLASH_SUS_V << SPI1_MEM_S_FLASH_SUS_S)
#define SPI1_MEM_S_FLASH_SUS_V  0x00000001U
#define SPI1_MEM_S_FLASH_SUS_S  0
/** SPI1_MEM_S_WAIT_PESR_CMD_2B : R/W; bitpos: [1]; default: 0;
 *  1: SPI1 sends out SPI1_MEM_S_WAIT_PESR_COMMAND[15:0] to check SUS/SUS1/SUS2 bit. 0:
 *  SPI1 sends out SPI1_MEM_S_WAIT_PESR_COMMAND[7:0] to check SUS/SUS1/SUS2 bit.
 */
#define SPI1_MEM_S_WAIT_PESR_CMD_2B    (BIT(1))
#define SPI1_MEM_S_WAIT_PESR_CMD_2B_M  (SPI1_MEM_S_WAIT_PESR_CMD_2B_V << SPI1_MEM_S_WAIT_PESR_CMD_2B_S)
#define SPI1_MEM_S_WAIT_PESR_CMD_2B_V  0x00000001U
#define SPI1_MEM_S_WAIT_PESR_CMD_2B_S  1
/** SPI1_MEM_S_FLASH_HPM_DLY_128 : R/W; bitpos: [2]; default: 0;
 *  1: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 128) SPI_CLK cycles after HPM
 *  command is sent. 0: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4) SPI_CLK
 *  cycles after HPM command is sent.
 */
#define SPI1_MEM_S_FLASH_HPM_DLY_128    (BIT(2))
#define SPI1_MEM_S_FLASH_HPM_DLY_128_M  (SPI1_MEM_S_FLASH_HPM_DLY_128_V << SPI1_MEM_S_FLASH_HPM_DLY_128_S)
#define SPI1_MEM_S_FLASH_HPM_DLY_128_V  0x00000001U
#define SPI1_MEM_S_FLASH_HPM_DLY_128_S  2
/** SPI1_MEM_S_FLASH_RES_DLY_128 : R/W; bitpos: [3]; default: 0;
 *  1: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 128) SPI_CLK cycles after RES
 *  command is sent. 0: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4) SPI_CLK
 *  cycles after RES command is sent.
 */
#define SPI1_MEM_S_FLASH_RES_DLY_128    (BIT(3))
#define SPI1_MEM_S_FLASH_RES_DLY_128_M  (SPI1_MEM_S_FLASH_RES_DLY_128_V << SPI1_MEM_S_FLASH_RES_DLY_128_S)
#define SPI1_MEM_S_FLASH_RES_DLY_128_V  0x00000001U
#define SPI1_MEM_S_FLASH_RES_DLY_128_S  3
/** SPI1_MEM_S_FLASH_DP_DLY_128 : R/W; bitpos: [4]; default: 0;
 *  1: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 128) SPI_CLK cycles after DP
 *  command is sent. 0: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4) SPI_CLK
 *  cycles after DP command is sent.
 */
#define SPI1_MEM_S_FLASH_DP_DLY_128    (BIT(4))
#define SPI1_MEM_S_FLASH_DP_DLY_128_M  (SPI1_MEM_S_FLASH_DP_DLY_128_V << SPI1_MEM_S_FLASH_DP_DLY_128_S)
#define SPI1_MEM_S_FLASH_DP_DLY_128_V  0x00000001U
#define SPI1_MEM_S_FLASH_DP_DLY_128_S  4
/** SPI1_MEM_S_FLASH_PER_DLY_128 : R/W; bitpos: [5]; default: 0;
 *  Valid when SPI1_MEM_S_FLASH_PER_WAIT_EN is 1. 1: SPI1 waits
 *  (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 128) SPI_CLK cycles after PER command is sent.
 *  0: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4) SPI_CLK cycles after PER
 *  command is sent.
 */
#define SPI1_MEM_S_FLASH_PER_DLY_128    (BIT(5))
#define SPI1_MEM_S_FLASH_PER_DLY_128_M  (SPI1_MEM_S_FLASH_PER_DLY_128_V << SPI1_MEM_S_FLASH_PER_DLY_128_S)
#define SPI1_MEM_S_FLASH_PER_DLY_128_V  0x00000001U
#define SPI1_MEM_S_FLASH_PER_DLY_128_S  5
/** SPI1_MEM_S_FLASH_PES_DLY_128 : R/W; bitpos: [6]; default: 0;
 *  Valid when SPI1_MEM_S_FLASH_PES_WAIT_EN is 1. 1: SPI1 waits
 *  (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 128) SPI_CLK cycles after PES command is sent.
 *  0: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4) SPI_CLK cycles after PES
 *  command is sent.
 */
#define SPI1_MEM_S_FLASH_PES_DLY_128    (BIT(6))
#define SPI1_MEM_S_FLASH_PES_DLY_128_M  (SPI1_MEM_S_FLASH_PES_DLY_128_V << SPI1_MEM_S_FLASH_PES_DLY_128_S)
#define SPI1_MEM_S_FLASH_PES_DLY_128_V  0x00000001U
#define SPI1_MEM_S_FLASH_PES_DLY_128_S  6
/** SPI1_MEM_S_SPI0_LOCK_EN : R/W; bitpos: [7]; default: 0;
 *  1: Enable SPI0 lock SPI0/1 arbiter option. 0: Disable it.
 */
#define SPI1_MEM_S_SPI0_LOCK_EN    (BIT(7))
#define SPI1_MEM_S_SPI0_LOCK_EN_M  (SPI1_MEM_S_SPI0_LOCK_EN_V << SPI1_MEM_S_SPI0_LOCK_EN_S)
#define SPI1_MEM_S_SPI0_LOCK_EN_V  0x00000001U
#define SPI1_MEM_S_SPI0_LOCK_EN_S  7
/** SPI1_MEM_S_FLASH_PESR_CMD_2B : R/W; bitpos: [15]; default: 0;
 *  1: The bit length of Program/Erase Suspend/Resume command is 16. 0: The bit length
 *  of Program/Erase Suspend/Resume command is 8.
 */
#define SPI1_MEM_S_FLASH_PESR_CMD_2B    (BIT(15))
#define SPI1_MEM_S_FLASH_PESR_CMD_2B_M  (SPI1_MEM_S_FLASH_PESR_CMD_2B_V << SPI1_MEM_S_FLASH_PESR_CMD_2B_S)
#define SPI1_MEM_S_FLASH_PESR_CMD_2B_V  0x00000001U
#define SPI1_MEM_S_FLASH_PESR_CMD_2B_S  15
/** SPI1_MEM_S_FLASH_PER_COMMAND : R/W; bitpos: [31:16]; default: 31354;
 *  Program/Erase resume command.
 */
#define SPI1_MEM_S_FLASH_PER_COMMAND    0x0000FFFFU
#define SPI1_MEM_S_FLASH_PER_COMMAND_M  (SPI1_MEM_S_FLASH_PER_COMMAND_V << SPI1_MEM_S_FLASH_PER_COMMAND_S)
#define SPI1_MEM_S_FLASH_PER_COMMAND_V  0x0000FFFFU
#define SPI1_MEM_S_FLASH_PER_COMMAND_S  16

/** SPI1_MEM_S_INT_ENA_REG register
 *  SPI1 interrupt enable register
 */
#define SPI1_MEM_S_INT_ENA_REG (DR_REG_PSRAM_MSPI1_BASE + 0xc0)
/** SPI1_MEM_S_PER_END_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The enable bit for SPI1_MEM_S_PER_END_INT interrupt.
 */
#define SPI1_MEM_S_PER_END_INT_ENA    (BIT(0))
#define SPI1_MEM_S_PER_END_INT_ENA_M  (SPI1_MEM_S_PER_END_INT_ENA_V << SPI1_MEM_S_PER_END_INT_ENA_S)
#define SPI1_MEM_S_PER_END_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_PER_END_INT_ENA_S  0
/** SPI1_MEM_S_PES_END_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The enable bit for SPI1_MEM_S_PES_END_INT interrupt.
 */
#define SPI1_MEM_S_PES_END_INT_ENA    (BIT(1))
#define SPI1_MEM_S_PES_END_INT_ENA_M  (SPI1_MEM_S_PES_END_INT_ENA_V << SPI1_MEM_S_PES_END_INT_ENA_S)
#define SPI1_MEM_S_PES_END_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_PES_END_INT_ENA_S  1
/** SPI1_MEM_S_WPE_END_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The enable bit for SPI1_MEM_S_WPE_END_INT interrupt.
 */
#define SPI1_MEM_S_WPE_END_INT_ENA    (BIT(2))
#define SPI1_MEM_S_WPE_END_INT_ENA_M  (SPI1_MEM_S_WPE_END_INT_ENA_V << SPI1_MEM_S_WPE_END_INT_ENA_S)
#define SPI1_MEM_S_WPE_END_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_WPE_END_INT_ENA_S  2
/** SPI1_MEM_S_SLV_ST_END_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for SPI1_MEM_S_SLV_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_SLV_ST_END_INT_ENA    (BIT(3))
#define SPI1_MEM_S_SLV_ST_END_INT_ENA_M  (SPI1_MEM_S_SLV_ST_END_INT_ENA_V << SPI1_MEM_S_SLV_ST_END_INT_ENA_S)
#define SPI1_MEM_S_SLV_ST_END_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_SLV_ST_END_INT_ENA_S  3
/** SPI1_MEM_S_MST_ST_END_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable bit for SPI1_MEM_S_MST_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_MST_ST_END_INT_ENA    (BIT(4))
#define SPI1_MEM_S_MST_ST_END_INT_ENA_M  (SPI1_MEM_S_MST_ST_END_INT_ENA_V << SPI1_MEM_S_MST_ST_END_INT_ENA_S)
#define SPI1_MEM_S_MST_ST_END_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_MST_ST_END_INT_ENA_S  4
/** SPI1_MEM_S_BROWN_OUT_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The enable bit for SPI1_MEM_S_BROWN_OUT_INT interrupt.
 */
#define SPI1_MEM_S_BROWN_OUT_INT_ENA    (BIT(10))
#define SPI1_MEM_S_BROWN_OUT_INT_ENA_M  (SPI1_MEM_S_BROWN_OUT_INT_ENA_V << SPI1_MEM_S_BROWN_OUT_INT_ENA_S)
#define SPI1_MEM_S_BROWN_OUT_INT_ENA_V  0x00000001U
#define SPI1_MEM_S_BROWN_OUT_INT_ENA_S  10

