espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_TIMING_CALI_REG register
 *  SPI1 timing control register
 */
#define SPI1_MEM_S_TIMING_CALI_REG (DR_REG_PSRAM_MSPI1_BASE + 0x180)
/** SPI1_MEM_S_TIMING_CALI : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable timing auto-calibration for all reading operations.
 */
#define SPI1_MEM_S_TIMING_CALI    (BIT(1))
#define SPI1_MEM_S_TIMING_CALI_M  (SPI1_MEM_S_TIMING_CALI_V << SPI1_MEM_S_TIMING_CALI_S)
#define SPI1_MEM_S_TIMING_CALI_V  0x00000001U
#define SPI1_MEM_S_TIMING_CALI_S  1
/** SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN : R/W; bitpos: [4:2]; default: 0;
 *  add extra dummy spi clock cycle length for spi clock calibration.
 */
#define SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN    0x00000007U
#define SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN_M  (SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN_V << SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN_S)
#define SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN_V  0x00000007U
#define SPI1_MEM_S_EXTRA_DUMMY_CYCLELEN_S  2

/** SPI1_MEM_S_CLOCK_GATE_REG register
 *  SPI1 clk_gate register
 */
#define SPI1_MEM_S_CLOCK_GATE_REG (DR_REG_PSRAM_MSPI1_BASE + 0x200)
/** SPI1_MEM_S_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Register clock gate enable signal. 1: Enable. 0: Disable.
 */
#define SPI1_MEM_S_CLK_EN    (BIT(0))
#define SPI1_MEM_S_CLK_EN_M  (SPI1_MEM_S_CLK_EN_V << SPI1_MEM_S_CLK_EN_S)
#define SPI1_MEM_S_CLK_EN_V  0x00000001U
#define SPI1_MEM_S_CLK_EN_S  0

/** SPI1_MEM_S_DATE_REG register
 *  Version control register
 */
#define SPI1_MEM_S_DATE_REG (DR_REG_PSRAM_MSPI1_BASE + 0x3fc)
/** SPI1_MEM_S_DATE : R/W; bitpos: [27:0]; default: 38801712;
 *  Version control register
 */
#define SPI1_MEM_S_DATE    0x0FFFFFFFU
#define SPI1_MEM_S_DATE_M  (SPI1_MEM_S_DATE_V << SPI1_MEM_S_DATE_S)
#define SPI1_MEM_S_DATE_V  0x0FFFFFFFU
#define SPI1_MEM_S_DATE_S  0

#ifdef __cplusplus
}
#endif
